## Class exercises:

In a new Jupyter notebook solve each excercise, and then upload them to GitHub. Name the notebook as 'ex_data_structures':

A. Turn this into a Data Frame name "friends":

In [1]:
import pandas

In [3]:
names=["Tomás", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,33,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

In [4]:
data={'names':names, 'woman':woman, 'ages':ages, 'country':country, 'education':education}
data

{'names': ['Tomás', 'Pauline', 'Pablo', 'Bjork', 'Alan', 'Juana'],
 'woman': [False, True, False, False, False, True],
 'ages': [32, 33, 28, 30, 32, 27],
 'country': ['Chile', 'Senegal', 'Spain', 'Norway', 'Peru', 'Peru'],
 'education': ['Bach', 'Bach', 'Master', 'PhD', 'Bach', 'Master']}

In [5]:
friends=pandas.DataFrame.from_dict(data)
friends

     names  woman  ages  country education
0    Tomás  False    32    Chile      Bach
1  Pauline   True    33  Senegal      Bach
2    Pablo  False    28    Spain    Master
3    Bjork  False    30   Norway       PhD
4     Alan  False    32     Peru      Bach
5    Juana   True    27     Peru    Master

### Homework

If you have the query:

In [ ]:
# where is the youngest male in the group from?

a. Find the answer using *sort_values()*

b. Do some research and find the answer using *[where()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.where.html)* and *[min()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.min.html)*

c. Do some research and find the answer using *[query()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.query.html)* and *[min()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.min.html)*

Solve this in a new Jupyter notebook, and then upload it to GitHub. Name the notebook as 'hw_data_structures'.

A

In [6]:
friends.sort_values(by="ages",ascending=True)

     names  woman  ages  country education
5    Juana   True    27     Peru    Master
2    Pablo  False    28    Spain    Master
3    Bjork  False    30   Norway       PhD
0    Tomás  False    32    Chile      Bach
4     Alan  False    32     Peru      Bach
1  Pauline   True    33  Senegal      Bach

In [7]:
friends[friends.woman==False].sort_values(by="ages",ascending=True).head(1).country

2    Spain
Name: country, dtype: object

B

In [14]:
newfriends = friends.where(friends.woman==False)
minage = newfriends.ages.min()
minage

28.0

In [15]:
friends[friends.ages==minage].country

2    Spain
Name: country, dtype: object

C

In [19]:
newfriends2 = friends.query('woman == False')
newfriends2

   names  woman  ages country education
0  Tomás  False    32   Chile      Bach
2  Pablo  False    28   Spain    Master
3  Bjork  False    30  Norway       PhD
4   Alan  False    32    Peru      Bach

In [20]:
minage2 = newfriends2.ages.min()
minage2

28

In [21]:
friends[friends.ages==minage2].country

2    Spain
Name: country, dtype: object

____

* [Go to page beginning](#beginning)
* [Go to REPO in Github](https://github.com/EvansDataScience/ComputationalThinking_Gov_1)
* [Go to Course schedule](https://evansdatascience.github.io/GovernanceAnalytics/)